---
title: BooleanOperationsUtils
classe: Autodesk.Revit.DB.BooleanOperationsUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# BooleanOperationsUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `booleanOperationsUtils.IsValidObject` | Boolean |
| `Solid CutWithHalfSpace(Solid, Plane)` | `BooleanOperationsUtils.CutWithHalfSpace(solid, plane)` | Solid |
| `Void CutWithHalfSpaceModifyingOriginalSolid(Solid, Plane)` | `BooleanOperationsUtils.CutWithHalfSpaceModifyingOriginalSolid(solid, plane)` | Void |
| `Void Dispose()` | `booleanOperationsUtils.Dispose()` | Void |
| `Solid ExecuteBooleanOperation(Solid, Solid, BooleanOperationsType)` | `BooleanOperationsUtils.ExecuteBooleanOperation(solid0, solid1, booleanType)` | Solid |
| `Void ExecuteBooleanOperationModifyingOriginalSolid(Solid, Solid, BooleanOperationsType)` | `BooleanOperationsUtils.ExecuteBooleanOperationModifyingOriginalSolid(solid0, solid1, booleanType)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```